#include<stdio.h>
#include<time.h>
#include<string.h>
#include"stu.h"
#include"fun.h"

vehicle ve[1001];//n小于1000
int n=0,sum=0;
double fee[5]={0};
char name[21];

int main(){
	//开始界面 
	printf("__________________________________________________________________\n");
	printf("                                                                  \n");
	printf("———————————#欢迎使用停车场管理系统！#—————————\n");
	printf("                      **************************                  \n");
	printf("__________________________________________________________________\n\n");
	//设置停车场
	printf("————————>>现在开始进行停车场的初始设置<<—————————\n");
	printf("__________________________________________________________________\n");	
	printf("                                                                  \n");
	settings();
	printf("__________________________________________________________________\n");	
	int i;
	for(i=0;i<n;i++) ve[i].Num=0;
	char t[20];
	menu();
	printf("请输入操作代号："); 
	while(scanf("%s",&t)){
		if(strcmp(t,"0")==0){
			printf("感谢使用本系统！\n");
			break;
		}if(strcmp(t,"1")==0){//有车进入
			printf("\n#%s停车场\n",name);
			printf("———————————>>停车场车辆登记<<—————————————\n");
	        printf("__________________________________________________________________\n");	
	        printf("                                                                  \n");
	        printf("ps：输入‘0’可返回主菜单\n");
			int in,t4;
			in=search();
			record(in);	
			printf("———————————————————————————————\n");
			printf("请问是否继续登记车辆：\n");	
			printf("1.是 2.否\n");	
			while(scanf("%d",&t4)&&t4!=0&&t4!=2){
				if(t4!=1){
					printf("输入有误，请重新输入：\n");
					continue; 
				}
				in=search();
				record(in);	
				printf("———————————————————————————————\n");
				printf("请问是否继续登记车辆：\n");	
				printf("1.是 2.否\n");					
			}	
			printf("__________________________________________________________________\n");	
			menu();
			printf("请输入操作代号："); 
		}else if(strcmp(t,"2")==0){//有车离开 
			printf("\n#%s停车场\n",name);
			printf("————————————>>停车费用结算<<—————————————\n");
	        printf("__________________________________________________________________\n");	
	        printf("                                                                  \n");	
	        printf("ps：输入‘0’可返回主菜单\n");
			int t1,t2;
			printf("请输入离开车辆的停车位号码：");
			while(scanf("%d",&t1)&&t1!=0){
				if(t1<1||t1>n){
					printf("输入无效，请重新输入\n");
					continue;
				}
				if(ve[t1].Num==0){
					printf("此停车位为空位，没有车，请重新输入：\n");
					continue;
				} 
				t2=confirm(t1);			
				if(t2==0) break;
				if(t2==2){
					printf("请重新输入离开车辆的停车位号码：");
					continue;
				}
				if(t2==1){
					cost(t1);
					interface(t1);//输出费用信息
					printf("———————————————————————————————\n");
					printf("请输入离开车辆的停车位号码(输入‘0’可返回主菜单)：");
				}
			} 						
        	printf("__________________________________________________________________\n");		
			menu();
			printf("请输入操作代号："); 
		}else if(strcmp(t,"3")==0){//显示 
			printf("\n#%s停车场\n",name);
			printf("————————————>>停车场车辆记录<<————————————\n");
        	printf("__________________________________________________________________\n");	
	        printf("                                                                  \n");				
			display();
			printf("__________________________________________________________________\n");
			menu();
			printf("请输入操作代号："); 
		}else if(strcmp(t,"4")==0){//查询 
			printf("\n#%s停车场\n",name);
			printf("————————————>>停车场车辆查询<<————————————\n");
	        printf("__________________________________________________________________\n");	
	        printf("                                                                  \n");	
			int t3;
			printf("1.按照停车位号码查询 2.按照车牌号查询 3.按照车型查询 0.返回主菜单\n");
			printf("请输入查询方式：");				
			while(scanf("%d",&t3)&&t3!=0){
				if(t3<1||t3>3){
					printf("输入有误，请重新输入：\n");	
					continue;
				} 
				inquire(t3);
				printf("———————————————————————————————\n");
				printf("1.按照停车位号码查询 2.按照车牌号查询 3.按照车型查询 0.返回主菜单\n");
				printf("请继续输入查询方式：");				
			}
			printf("__________________________________________________________________\n");	
			menu();
			printf("请输入操作代号："); 
		}else if(strcmp(t,"5")==0){//统计 
			printf("\n#%s停车场\n",name);
			printf("————————————>>停车场车辆统计<<————————————\n");
	        printf("__________________________________________________________________\n");	
	        printf("                                                                  \n");			
			printf("*停车场目前已停%d辆车\n",sum);
			printf("——————————————————\n");
			printf("*按照车辆型号进行统计：\n",sum);
			modelstats();
			printf("——————————————————\n");
			printf("*按照到达时间进行统计：\n",sum);
			timestats();	
			printf("__________________________________________________________________\n");	
			menu();	
			printf("请输入操作代号："); 	
		}else printf("输入无效，请重新输入：");
	} 
	return 0;
} 









 
